/*▄──────────────────────────────────────────────────────────────────────────────────────────────▄
  █                                                                                              █
  █  Формат файлов по умолчанию всегда равен "text", то есть еще "json".                         █
  █  Ниже приведен пример работы с JSON-файлом.                                                  █
  █                                                                                              █
  ▀──────────────────────────────────────────────────────────────────────────────────────────────▀*/
const File = require('../src/app.file');
const Storage = new File('./storage', 'json');

/*┌────────────────────────────┐
  │ Создание и чтение из файла │
  └────────────────────────────┘*/
Storage.add('file1.json', {name:'Mick', level:5});
Storage.get('file1.json', (res, json) => {
    console.log(json);
});
//=> { name: 'Mick', level: 5 }

/*┌──────────────────────────┐
  │ Запись и чтение из файла │
  └──────────────────────────┘*/
Storage.set('file1.json', {name:'Jonni', level:6});
Storage.get('file1.json', (res, json) => {
    console.log(json);
});
//=> { name: 'Jonni', level: 6 }

/*┌────────────────┐
  │ Удаление файла │
  └────────────────┘*/
Storage.del('file1.json');

/*────────────────────────────────────────────────────────────────────────────────────────────────*/