/*▄──────────────────────────────────────────────────────────────────────────────────────────────▄
  █                                                                                              █
  █  В данном примере продемонстрирована работа с файлами через Promise и Callback.              █
  █                                                                                              █
  ▀──────────────────────────────────────────────────────────────────────────────────────────────▀*/
const File = require('../src/app.file');
const Storage = new File('./storage');
let res;

/*▄──────────────────────────────────────────────────────────────────────────────────────────────▄
  █                                                                                              █
  █  Использование как Promise                                                                   █
  █                                                                                              █
  ▀──────────────────────────────────────────────────────────────────────────────────────────────▀*/
(async () => {
/*┌────────────────┐
  │ Создание файла │
  └────────────────┘*/
    res = await Storage.add('file1.txt', 'Текст 123');
    console.log(res);
    
/*┌───────────────┐
  │ Запись в файл │
  └───────────────┘*/
    res = await Storage.set('file1.txt', 'Новый текст 789');
    console.log(res);
    
/*┌─────────────────┐
  │ Чтение из файла │
  └─────────────────┘*/
    res = await Storage.get('file1.txt');
    console.log(res);
    
/*┌────────────────┐
  │ Удаление файла │
  └────────────────┘*/
    res = await Storage.del('file1.txt');
    console.log(res);
    
/*┌─────────────────┐
  │ Чтение каталога │
  └─────────────────┘*/
    res = await Storage.readdir('.');
    console.log(res);
})();

/*▄──────────────────────────────────────────────────────────────────────────────────────────────▄
  █                                                                                              █
  █  Использование как Callback                                                                  █
  █                                                                                              █
  ▀──────────────────────────────────────────────────────────────────────────────────────────────▀*/
/*┌────────────────┐
  │ Создание файла │
  └────────────────┘*/
Storage.add('file1.txt', 'Текст 123', (res) => {
    console.log(res);
});

/*┌───────────────┐
  │ Запись в файл │
  └───────────────┘*/
Storage.set('file1.txt', 'Новый текст 789', (res) => {
    console.log(res);
});

/*┌─────────────────┐
  │ Чтение из файла │
  └─────────────────┘*/
Storage.get('file1.txt', (res, content) => {
    console.log(res);
    console.log(content);
});

/*┌────────────────┐
  │ Удаление файла │
  └────────────────┘*/
Storage.del('file1.txt', (res) => {
    console.log(res);
});

/*┌─────────────────┐
  │ Чтение каталога │
  └─────────────────┘*/
Storage.readdir('.', (res) => {
    console.log(res);
});

/*────────────────────────────────────────────────────────────────────────────────────────────────*/